app/controllers/drugs_controller.rb

SELECT * FROM `drugs`
---
  def index
    @drugs = Drug.all

SELECT * FROM `drugs` WHERE (`drugs`.`id` = 1)
---
  def show
    @drug = Drug.find(params[:id])

INSERT INTO `drugs` (`substrate_name`, `class_name`, `created_at`, `updated_at`, `status`) VALUES('clozapine', '1A2', '2010-05-20 11:56:01', '2010-05-20 11:56:01', 0)
---
  def create
    @drug = Drug.new(params[:drug])

    respond_to do |format|
      if @drug.save

SELECT * FROM `drugs` WHERE (`drugs`.`id` = 1)
DELETE FROM `drugs` WHERE `id` = 1
---
  def destroy
    @drug = Drug.find(params[:id])
    @drug.destroy